#### [`repos-official-new`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-hcp-go_repo_4C9D8FDA: Preparing import... [id=cdktn-provider-hcp-go]
github_repository.cdktn-provider-hcp_repo_8F20D8D5: Preparing import... [id=cdktn-provider-hcp]
github_repository.cdktn-provider-hcp-go_repo_4C9D8FDA: Refreshing state... [id=cdktn-provider-hcp-go]
data.github_team.cdktn-team-cdk-terrain: Reading...
github_repository.cdktn-provider-dns-go_repo_3883B88C: Refreshing state... [id=cdktn-provider-dns-go]
github_repository.cdktn-provider-dns_repo_60FE1B06: Refreshing state... [id=cdktn-provider-dns]
github_repository.cdktn-provider-http_repo_5B821B5F: Refreshing state... [id=cdktn-provider-http]
github_repository.cdktn-provider-hcp_repo_8F20D8D5: Refreshing state... [id=cdktn-provider-hcp]
github_repository.cdktn-provider-http-go_repo_EF7D8730: Refreshing state... [id=cdktn-provider-http-go]
github_issue_label.cdktn-provider-dns-go_repository-setup_automerge-label_383D35E0: Refreshing state... [id=cdktn-provider-dns-go:automerge]
github_issue_label.cdktn-provider-dns-go_repository-setup_auto-approve-label_36B7CA1B: Refreshing state... [id=cdktn-provider-dns-go:auto-approve]
github_issue_label.cdktn-provider-dns-go_repository-setup_no-auto-close-label_98432EB1: Refreshing state... [id=cdktn-provider-dns-go:no-auto-close]
github_repository_webhook.cdktn-provider-dns-go_repository-setup_slack-webhook_81359FD7: Refreshing state... [id=591036173]
github_issue_label.cdktn-provider-http_repository-setup_automerge-label_A0C5597B: Refreshing state... [id=cdktn-provider-http:automerge]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_14DDCE07: Refreshing state... [id=cdktn-provider-http:GO_GITHUB_TOKEN]
github_repository_webhook.cdktn-provider-http_repository-setup_slack-webhook_F059E3CA: Refreshing state... [id=591033492]
github_actions_secret.cdktn-provider-http_repo_secret-alert-prs-slack-webhook-url_BDC541B3: Refreshing state... [id=cdktn-provider-http:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id-alias-PROJEN_APP_ID_F8F3C7E3: Refreshing state... [id=cdktn-provider-http:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-http_repo_secret-npm-token_8061869F: Refreshing state... [id=cdktn-provider-http:NPM_TOKEN]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token_B691F459: Refreshing state... [id=cdktn-provider-http:GH_TOKEN]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_080A2364: Refreshing state... [id=cdktn-provider-http:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-http_repo_secret-twine-username_764E0074: Refreshing state... [id=cdktn-provider-http:TWINE_USERNAME]
github_issue_label.cdktn-provider-http_repository-setup_no-auto-close-label_0AA88912: Refreshing state... [id=cdktn-provider-http:no-auto-close]
github_actions_secret.cdktn-provider-http_repo_secret-twine-password_D7E445AE: Refreshing state... [id=cdktn-provider-http:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F0352969: Refreshing state... [id=cdktn-provider-http:PROJEN_APP_PRIVATE_KEY]
data.github_team.cdktn-team-cdk-terrain: Read complete after 4s [id=15746607]
github_repository_dependabot_security_updates.cdktn-provider-http_dependabot-security_15C0CF03: Refreshing state... [id=cdktn-provider-http]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id_E8794717: Refreshing state... [id=cdktn-provider-http:GH_APP_ID]
github_issue_label.cdktn-provider-http_repository-setup_auto-approve-label_19956EF2: Refreshing state... [id=cdktn-provider-http:auto-approve]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key_6F6E0F82: Refreshing state... [id=cdktn-provider-http:GH_APP_PRIVATE_KEY]
github_branch_protection.cdktn-provider-http_repository-setup_main-protection_62E00E3E: Refreshing state... [id=BPR_kwDOQ3wxqc4EQ96I]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token_7730C1FC: Refreshing state... [id=cdktn-provider-dns:GH_TOKEN]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id-alias-PROJEN_APP_ID_C5FA55A4: Refreshing state... [id=cdktn-provider-dns:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-dns_repo_secret-npm-token_0DB44AAF: Refreshing state... [id=cdktn-provider-dns:NPM_TOKEN]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key_D6AE050F: Refreshing state... [id=cdktn-provider-dns:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id_1792033E: Refreshing state... [id=cdktn-provider-dns:GH_APP_ID]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9EC25F2C: Refreshing state... [id=cdktn-provider-dns:GO_GITHUB_TOKEN]
github_branch_protection.cdktn-provider-dns_repository-setup_main-protection_5B21E0B4: Refreshing state... [id=BPR_kwDOQ3xdJs4EQ99z]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_E1562C5A: Refreshing state... [id=cdktn-provider-dns:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktn-provider-dns_repository-setup_no-auto-close-label_FCA7B78C: Refreshing state... [id=cdktn-provider-dns:no-auto-close]
github_issue_label.cdktn-provider-dns_repository-setup_auto-approve-label_FEBBFBED: Refreshing state... [id=cdktn-provider-dns:auto-approve]
github_actions_secret.cdktn-provider-dns_repo_secret-twine-username_A225ECA9: Refreshing state... [id=cdktn-provider-dns:TWINE_USERNAME]
github_issue_label.cdktn-provider-dns_repository-setup_automerge-label_676A1785: Refreshing state... [id=cdktn-provider-dns:automerge]
github_repository_webhook.cdktn-provider-dns_repository-setup_slack-webhook_900EEF0E: Refreshing state... [id=591036107]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_3584BDE6: Refreshing state... [id=cdktn-provider-dns:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-dns_repo_secret-twine-password_993A280C: Refreshing state... [id=cdktn-provider-dns:TWINE_PASSWORD]
github_repository_dependabot_security_updates.cdktn-provider-dns_dependabot-security_2BE66F99: Refreshing state... [id=cdktn-provider-dns]
github_actions_secret.cdktn-provider-dns_repo_secret-alert-prs-slack-webhook-url_C4EC3CB5: Refreshing state... [id=cdktn-provider-dns:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktn-provider-http-go_repository-setup_automerge-label_7591A00F: Refreshing state... [id=cdktn-provider-http-go:automerge]
github_issue_label.cdktn-provider-http-go_repository-setup_no-auto-close-label_B8B23FD0: Refreshing state... [id=cdktn-provider-http-go:no-auto-close]
github_issue_label.cdktn-provider-http-go_repository-setup_auto-approve-label_B0479E1C: Refreshing state... [id=cdktn-provider-http-go:auto-approve]
github_repository_webhook.cdktn-provider-http-go_repository-setup_slack-webhook_929855F1: Refreshing state... [id=591033559]
github_team_repository.cdktn-provider-dns_repository-setup_managing-team_663759C4: Refreshing state... [id=15746607:cdktn-provider-dns]
github_team_repository.cdktn-provider-dns-go_repository-setup_managing-team_D1AE7297: Refreshing state... [id=15746607:cdktn-provider-dns-go]
github_team_repository.cdktn-provider-http-go_repository-setup_managing-team_ABF10800: Refreshing state... [id=15746607:cdktn-provider-http-go]
github_team_repository.cdktn-provider-http_repository-setup_managing-team_D727E80F: Refreshing state... [id=15746607:cdktn-provider-http]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-hcp_repo_secret-alert-prs-slack-webhook-url_CBDC2CE9 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-alert-prs-slack-webhook-url_CBDC2CE9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E2AB9F33 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E2AB9F33" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id_48D8355E will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-id_48D8355E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_09540776 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_09540776" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key_280D74C1 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-private-key_280D74C1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5FE18D77 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5FE18D77" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F60282E5 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F60282E5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token_35D43952 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token_35D43952" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-npm-token_457354E1 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-npm-token_457354E1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-twine-password_0C44EB37 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-twine-password_0C44EB37" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-twine-username_4610D963 will be created
  + resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-twine-username_4610D963" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-hcp"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-hcp_repository-setup_main-protection_4552043C will be created
  + resource "github_branch_protection" "cdktn-provider-hcp_repository-setup_main-protection_4552043C" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-hcp"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-hcp-go_repository-setup_auto-approve-label_E7903823 will be created
  + resource "github_issue_label" "cdktn-provider-hcp-go_repository-setup_auto-approve-label_E7903823" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-hcp-go_repository-setup_automerge-label_638B4D49 will be created
  + resource "github_issue_label" "cdktn-provider-hcp-go_repository-setup_automerge-label_638B4D49" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-hcp-go_repository-setup_no-auto-close-label_1767D895 will be created
  + resource "github_issue_label" "cdktn-provider-hcp-go_repository-setup_no-auto-close-label_1767D895" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-hcp_repository-setup_auto-approve-label_25C66990 will be created
  + resource "github_issue_label" "cdktn-provider-hcp_repository-setup_auto-approve-label_25C66990" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-hcp_repository-setup_automerge-label_869BE428 will be created
  + resource "github_issue_label" "cdktn-provider-hcp_repository-setup_automerge-label_869BE428" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-hcp_repository-setup_no-auto-close-label_A0A3D64B will be created
  + resource "github_issue_label" "cdktn-provider-hcp_repository-setup_no-auto-close-label_A0A3D64B" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-hcp"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-hcp-go_repo_4C9D8FDA will be updated in-place
  # (imported from "cdktn-provider-hcp-go")
  ~ resource "github_repository" "cdktn-provider-hcp-go_repo_4C9D8FDA" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for hcp."
        etag                        = "W/\"cd66e59662e6d2059896d5a0acb0faa330347f07cf3cb12025b51b15c9b7cf64\""
        full_name                   = "cdktn-io/cdktn-provider-hcp-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-hcp-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-hcp-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-hcp-go.git"
        id                          = "cdktn-provider-hcp-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-hcp-go"
        node_id                     = "R_kgDORTlojg"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1161390222
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-hcp-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-hcp-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "hcp",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-hcp_repo_8F20D8D5 will be updated in-place
  # (imported from "cdktn-provider-hcp")
  ~ resource "github_repository" "cdktn-provider-hcp_repo_8F20D8D5" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for hcp."
        etag                        = "W/\"72dd7a8464a1d2601650e002739bdf75c18b100895cc78222e05841a5c6228af\""
        full_name                   = "cdktn-io/cdktn-provider-hcp"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-hcp.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-hcp"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-hcp.git"
        id                          = "cdktn-provider-hcp"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-hcp"
        node_id                     = "R_kgDORTlnYw"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1161389923
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-hcp.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-hcp"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "hcp",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-hcp_dependabot-security_0A947AF5 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-hcp_dependabot-security_0A947AF5" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-hcp"
    }

  # github_repository_webhook.cdktn-provider-hcp-go_repository-setup_slack-webhook_CD7D7DB4 will be created
  + resource "github_repository_webhook" "cdktn-provider-hcp-go_repository-setup_slack-webhook_CD7D7DB4" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-hcp-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-hcp_repository-setup_slack-webhook_EBF302ED will be created
  + resource "github_repository_webhook" "cdktn-provider-hcp_repository-setup_slack-webhook_EBF302ED" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-hcp"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-hcp-go_repository-setup_managing-team_C8B8DF9F will be created
  + resource "github_team_repository" "cdktn-provider-hcp-go_repository-setup_managing-team_C8B8DF9F" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-hcp-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-hcp_repository-setup_managing-team_B30BAFB6 will be created
  + resource "github_team_repository" "cdktn-provider-hcp_repository-setup_managing-team_B30BAFB6" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-hcp"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos = [
        "github_repository.cdktn-provider-dns_repo_60FE1B06.ssh_clone_url",
      + "github_repository.cdktn-provider-hcp_repo_8F20D8D5.ssh_clone_url",
        "github_repository.cdktn-provider-http_repo_5B821B5F.ssh_clone_url",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*